#!/bin/bash

# Koval Kostiantyn IO-25
# 2514 mod 6 = 0

if [ $# -ne 2 ]; then
    echo "Помилка: потрібно рівно два числові параметри"
    echo "Використання: $0 число1 число2"
    exit 1
fi

if ! [[ $1 =~ ^[0-9]+([.][0-9]+)?$ ]] || ! [[ $2 =~ ^[0-9]+([.][0-9]+)?$ ]]; then
    echo "Помилка: обидва параметри повинні бути числами"
    exit 1
fi


SCRIPT_NAME=$(basename "$0")

if (( $(echo "$1 > $2" | bc -l) )); then
    echo "Перший параметр ($1) більший за другий параметр ($2)"
    echo -e "\nСписок псевдонімів (alias) системи:"
    bash -ic 'alias' 2>/dev/null
else
    echo "Перший параметр ($1) не більший за другий параметр ($2)"
    echo -e "\nРозмір файлу скрипта $SCRIPT_NAME:"
    ls -lh "$0" | awk '{print $5}'
fi




































